davidgoddard/mower2026/external-hardware/esp32/motor-controller/motor-controller.ino
#include <Arduino.h>
#include <Wire.h>
#include "driver/ledc.h"
#include "esp_task_wdt.h"
#include "esp_idf_version.h"

// Second-generation motor controller for ESP32.
// It accepts explicit left/right wheel percentage targets over I2C, applies
// local ramping and safe direction reversals, and returns a coherent feedback
// snapshot with FG pulse deltas, applied PWM, current, and watchdog/fault
// state.
//
// This sketch intentionally does NOT run any local wheel-speed regulation from
// encoder feedback. The Pi is the controller. This ESP32 is only a ramped PWM
// bridge plus telemetry source.
//
// Encoder signing: each tachometer line is single-channel (no quadrature), so
// pulse direction is inferred from a cached "last commanded direction" sign
// per wheel (g_leftDirSign / g_rightDirSign). applyMotorHardware updates the
// cache in lockstep with the DIR-pin write, so the cache is the canonical
// record of the last commanded direction and the encoder ISR signs each
// pulse from it directly. The cache is only flipped after the firmware has
// ramped PWM magnitude through zero, so coast pulses during brake-to-stop
// and during direction reversals are signed by the direction the wheel was
// actually rolling at the moment of the pulse — not by whether the motor
// is currently powered.

// ===== I2C / protocol =====
static const uint8_t I2C_SLAVE_ADDRESS = 0x66;
static const uint8_t PROTOCOL_START_OF_FRAME = 0x4D;
static const uint8_t PROTOCOL_VERSION = 0x01;
static const uint8_t NODE_ID_MOTOR = 0x20;
static const uint8_t MESSAGE_TYPE_WHEEL_SPEED_COMMAND = 0x21;
static const uint8_t MESSAGE_TYPE_MOTOR_FEEDBACK = 0x22;

static const size_t FRAME_HEADER_SIZE = 9;
static const size_t FRAME_CRC_SIZE = 2;
static const size_t WHEEL_COMMAND_PAYLOAD_SIZE = 15;
static const size_t MOTOR_FEEDBACK_PAYLOAD_SIZE = 21;
static const size_t MOTOR_FEEDBACK_FRAME_SIZE = FRAME_HEADER_SIZE + MOTOR_FEEDBACK_PAYLOAD_SIZE + FRAME_CRC_SIZE;
static const size_t MAX_FRAME_SIZE = MOTOR_FEEDBACK_FRAME_SIZE;

// ===== Pins =====
static const uint8_t SDA_PIN = 16;
static const uint8_t SCL_PIN = 17;

static const uint8_t LEFT_PWM_PIN = 5;
static const uint8_t LEFT_DIR_PIN = 18;
static const uint8_t RIGHT_PWM_PIN = 14;
static const uint8_t RIGHT_DIR_PIN = 19;

static const uint8_t LEFT_TACH_PIN = 21;
static const uint8_t RIGHT_TACH_PIN = 22;
static const uint8_t LEFT_CURRENT_SENSE_PIN = 34;
static const uint8_t RIGHT_CURRENT_SENSE_PIN = 35;

// ===== PWM =====
static const uint32_t PWM_FREQ_HZ = 30000;
static const ledc_mode_t PWM_MODE = LEDC_HIGH_SPEED_MODE;
static const ledc_timer_bit_t PWM_RESOLUTION = LEDC_TIMER_8_BIT;
static const ledc_timer_t PWM_TIMER = LEDC_TIMER_0;
static const ledc_channel_t LEFT_CHANNEL = LEDC_CHANNEL_0;
static const ledc_channel_t RIGHT_CHANNEL = LEDC_CHANNEL_1;
static const int PWM_MAX_DUTY = 255;

// ===== Control / reporting =====
static const uint32_t CONTROL_PERIOD_MS = 10;      // 100 Hz
static const uint32_t FEEDBACK_PERIOD_MS = 50;     // 20 Hz
static const uint32_t TASK_WATCHDOG_TIMEOUT_SECONDS = 5;
// Decel / accel rates in %/s.  At 100 Hz (10 ms ticks):
//   stepPerTick = rate × elapsedMs / 1000 = rate × 0.010
// DEFAULT_DECEL_PERCENT_PER_SECOND = 250  →  2.5 %/tick  →  40-tick (400 ms) full stop.
// DEFAULT_ACCEL_PERCENT_PER_SECOND = 167  →  1.67 %/tick →  60-tick (600 ms) full spin-up.
static const float DEFAULT_DECEL_PERCENT_PER_SECOND = 250.0f;
static const float DEFAULT_ACCEL_PERCENT_PER_SECOND = 167.0f;
static const float DEFAULT_MIN_EFFECTIVE_WHEEL_OUTPUT_PERCENT = 0.025f;
static const float CURRENT_SENSOR_SUPPLY_VOLTS = 3.3f;
static const float CURRENT_SENSOR_VOLTS_PER_AMP = 0.185f;  // ACS712ELC-05B typical sensitivity
static const float CURRENT_SENSOR_FILTER_ALPHA = 0.2f;
static const uint16_t CURRENT_SENSOR_CALIBRATION_SAMPLES = 128;
static const uint16_t ADC_MAX_COUNT = 4095;

// ===== Fault bits =====
static const uint16_t MOTOR_FAULT_LEFT_DRIVER = (1u << 3);
static const uint16_t MOTOR_FAULT_RIGHT_DRIVER = (1u << 4);
static const uint16_t MOTOR_FAULT_OVERCURRENT = (1u << 5);
static const uint16_t MOTOR_FAULT_COMMAND_TIMEOUT = (1u << 0);

struct WheelSpeedCommand {
  uint32_t timestampMillis;
  float leftWheelTargetPercent;
  float rightWheelTargetPercent;
  bool enableDrive;
  uint16_t commandTimeoutMillis;
  bool hasAccelLimit;
  float maxAccelerationPercentPerSecond;
  bool hasDecelLimit;
  float maxDecelerationPercentPerSecond;
};

struct FeedbackSnapshot {
  uint32_t timestampMillis;
  int32_t leftEncoderDelta;
  int32_t rightEncoderDelta;
  int8_t leftPwmAppliedPercent;
  int8_t rightPwmAppliedPercent;
  float leftMotorCurrentAmps;
  float rightMotorCurrentAmps;
  bool watchdogHealthy;
  uint16_t faultFlags;
};

struct MotorState {
  const char *label;
  ledc_channel_t pwmChannel;
  uint8_t pwmPin;
  uint8_t dirPin;
  bool inverted;
  int8_t appliedPwmPercent;
  int8_t requestedPwmPercent;
  int8_t currentDirectionSign;
  bool directionChangePending;
  float targetPercent;
  float rampedTargetPercent;
};

struct CurrentSensorState {
  uint8_t pin;
  float zeroVoltageVolts;
  float filteredCurrentAmps;
};

volatile int32_t g_leftPulseAccumulator = 0;
volatile int32_t g_rightPulseAccumulator = 0;
volatile uint32_t g_lastLeftPulseMicros = 0;
volatile uint32_t g_lastRightPulseMicros = 0;
// Last sign written to the DIR pin for each wheel. The encoder ISRs sign
// each pulse by this value so coast pulses during brake-to-stop are
// attributed to the direction the wheel was last driven, not zeroed.
// applyMotorHardware updates these together with the digitalWrite that
// drives the DIR pin, so there is exactly one source of truth.
volatile int8_t g_leftDirSign = 1;
volatile int8_t g_rightDirSign = 1;
static const uint32_t ENCODER_DEBOUNCE_MICROS = 800;

MotorState g_leftMotor = { "left", LEFT_CHANNEL, LEFT_PWM_PIN, LEFT_DIR_PIN, false, 0, 0, 1, false, 0.0f, 0.0f };
MotorState g_rightMotor = { "right", RIGHT_CHANNEL, RIGHT_PWM_PIN, RIGHT_DIR_PIN, true, 0, 0, 1, false, 0.0f, 0.0f };

WheelSpeedCommand g_latestCommand = { 0, 0.0f, 0.0f, false, 0, false, 0.0f, false, 0.0f };
FeedbackSnapshot g_latestFeedback = { 0, 0, 0, 0, 0, 0.0f, 0.0f, false, 0 };
CurrentSensorState g_leftCurrentSensor = { LEFT_CURRENT_SENSE_PIN, CURRENT_SENSOR_SUPPLY_VOLTS / 2.0f, 0.0f };
CurrentSensorState g_rightCurrentSensor = { RIGHT_CURRENT_SENSE_PIN, CURRENT_SENSOR_SUPPLY_VOLTS / 2.0f, 0.0f };

portMUX_TYPE g_protocolStateMux = portMUX_INITIALIZER_UNLOCKED;

uint8_t g_txFrames[2][MOTOR_FEEDBACK_FRAME_SIZE];
volatile uint8_t g_activeTxFrameIndex = 0;
uint16_t g_feedbackSequence = 0;
uint32_t g_lastValidCommandMillis = 0;
bool g_haveValidCommand = false;
bool g_commandLeaseHealthy = false;

