davidgoddard/mower2026/external-hardware/esp32/motor-controller/motor-controller.ino
uint32_t g_lastControlMillis = 0;
uint32_t g_lastFeedbackMillis = 0;

// ===== Helpers =====
uint16_t crc16Ccitt(const uint8_t *data, size_t length) {
  uint16_t crc = 0xFFFF;
  for (size_t index = 0; index < length; index += 1) {
    crc ^= static_cast<uint16_t>(data[index]) << 8;
    for (uint8_t bit = 0; bit < 8; bit += 1) {
      if ((crc & 0x8000) != 0) {
        crc = static_cast<uint16_t>((crc << 1) ^ 0x1021);
      } else {
        crc = static_cast<uint16_t>(crc << 1);
      }
    }
  }
  return crc;
}

uint16_t readU16LE(const uint8_t *bytes) {
  return static_cast<uint16_t>(bytes[0]) | (static_cast<uint16_t>(bytes[1]) << 8);
}

uint32_t readU32LE(const uint8_t *bytes) {
  return static_cast<uint32_t>(bytes[0])
       | (static_cast<uint32_t>(bytes[1]) << 8)
       | (static_cast<uint32_t>(bytes[2]) << 16)
       | (static_cast<uint32_t>(bytes[3]) << 24);
}

int16_t readI16LE(const uint8_t *bytes) {
  return static_cast<int16_t>(readU16LE(bytes));
}

int32_t readI32LE(const uint8_t *bytes) {
  return static_cast<int32_t>(readU32LE(bytes));
}

void writeU16LE(uint8_t *bytes, uint16_t value) {
  bytes[0] = static_cast<uint8_t>(value & 0xFF);
  bytes[1] = static_cast<uint8_t>((value >> 8) & 0xFF);
}

void writeU32LE(uint8_t *bytes, uint32_t value) {
  bytes[0] = static_cast<uint8_t>(value & 0xFF);
  bytes[1] = static_cast<uint8_t>((value >> 8) & 0xFF);
  bytes[2] = static_cast<uint8_t>((value >> 16) & 0xFF);
  bytes[3] = static_cast<uint8_t>((value >> 24) & 0xFF);
}

void writeI16LE(uint8_t *bytes, int16_t value) {
  writeU16LE(bytes, static_cast<uint16_t>(value));
}

void writeI32LE(uint8_t *bytes, int32_t value) {
  writeU32LE(bytes, static_cast<uint32_t>(value));
}

int8_t clampPercent(int value) {
  if (value < -100) return -100;
  if (value > 100) return 100;
  return static_cast<int8_t>(value);
}

float clampFloat(float value, float minValue, float maxValue) {
  if (value < minValue) return minValue;
  if (value > maxValue) return maxValue;
  return value;
}

uint16_t encodeCurrentTenths(float amps) {
  float clamped = clampFloat(amps, 0.0f, 6553.4f);
  return static_cast<uint16_t>((clamped * 10.0f) + 0.5f);
}

// ===== Encoder ISR =====
//
// Single-line tachometer: each pulse reports physical wheel rotation, but the
// pulse alone has no direction. We sign each pulse by g_leftDirSign /
// g_rightDirSign, which applyMotorHardware updates atomically with the
// DIR-pin write — so the cache is the canonical record of the last
// commanded direction. Crucially this is correct during the brake/coast
// window (DIR is unchanged, so coast pulses inherit the last commanded
// direction) and during a direction reversal (the firmware ramps PWM
// magnitude to zero before flipping DIR, so deceleration pulses keep the
// OLD sign and post-flip pulses pick up the NEW sign).
void IRAM_ATTR onLeftPulse() {
  uint32_t now = micros();
  if (now - g_lastLeftPulseMicros > ENCODER_DEBOUNCE_MICROS) {
    g_leftPulseAccumulator += g_leftDirSign;
    g_lastLeftPulseMicros = now;
  }
}

void IRAM_ATTR onRightPulse() {
  uint32_t now = micros();
  if (now - g_lastRightPulseMicros > ENCODER_DEBOUNCE_MICROS) {
    g_rightPulseAccumulator += g_rightDirSign;
    g_lastRightPulseMicros = now;
  }
}

// ===== Protocol handling =====
bool decodeFrame(const uint8_t *frame, size_t length, uint8_t &messageType, uint16_t &sequence, const uint8_t *&payload, uint16_t &payloadLength) {
  if (length < FRAME_HEADER_SIZE + FRAME_CRC_SIZE) {
    return false;
  }
  if (frame[0] != PROTOCOL_START_OF_FRAME || frame[1] != PROTOCOL_VERSION || frame[2] != NODE_ID_MOTOR) {
    return false;
  }

  messageType = frame[3];
  sequence = readU16LE(&frame[5]);
  payloadLength = readU16LE(&frame[7]);
  size_t expectedLength = FRAME_HEADER_SIZE + payloadLength + FRAME_CRC_SIZE;
  if (length != expectedLength) {
    return false;
  }

  uint16_t actualCrc = readU16LE(&frame[FRAME_HEADER_SIZE + payloadLength]);
  uint16_t expectedCrc = crc16Ccitt(&frame[1], FRAME_HEADER_SIZE - 1 + payloadLength);
  if (actualCrc != expectedCrc) {
    return false;
  }

  payload = &frame[FRAME_HEADER_SIZE];
  return true;
}

size_t encodeFrame(uint8_t messageType, uint16_t sequence, uint8_t flags, const uint8_t *payload, uint16_t payloadLength, uint8_t *outFrame) {
  outFrame[0] = PROTOCOL_START_OF_FRAME;
  outFrame[1] = PROTOCOL_VERSION;
  outFrame[2] = NODE_ID_MOTOR;
  outFrame[3] = messageType;
  outFrame[4] = flags;
  writeU16LE(&outFrame[5], sequence);
  writeU16LE(&outFrame[7], payloadLength);
  memcpy(&outFrame[FRAME_HEADER_SIZE], payload, payloadLength);
  uint16_t crc = crc16Ccitt(&outFrame[1], FRAME_HEADER_SIZE - 1 + payloadLength);
  writeU16LE(&outFrame[FRAME_HEADER_SIZE + payloadLength], crc);
  return FRAME_HEADER_SIZE + payloadLength + FRAME_CRC_SIZE;
}

bool decodeWheelSpeedCommandPayload(const uint8_t *payload, uint16_t payloadLength, WheelSpeedCommand &command) {
  if (payloadLength != WHEEL_COMMAND_PAYLOAD_SIZE) {
    return false;
  }

  command.timestampMillis = readU32LE(&payload[0]);
  command.leftWheelTargetPercent = static_cast<float>(readI16LE(&payload[4])) / 1000.0f;
  command.rightWheelTargetPercent = static_cast<float>(readI16LE(&payload[6])) / 1000.0f;
  command.enableDrive = payload[8] == 1;
  command.commandTimeoutMillis = readU16LE(&payload[9]);

  uint16_t accelRaw = readU16LE(&payload[11]);
  command.hasAccelLimit = accelRaw != 0xFFFF;
  command.maxAccelerationPercentPerSecond = command.hasAccelLimit ? static_cast<float>(accelRaw) / 1000.0f : 0.0f;

  uint16_t decelRaw = readU16LE(&payload[13]);
  command.hasDecelLimit = decelRaw != 0xFFFF;
  command.maxDecelerationPercentPerSecond = command.hasDecelLimit ? static_cast<float>(decelRaw) / 1000.0f : 0.0f;
  return true;
}

void encodeMotorFeedbackPayload(const FeedbackSnapshot &feedback, uint8_t *payloadOut) {
  writeU32LE(&payloadOut[0], feedback.timestampMillis);
  writeI32LE(&payloadOut[4], feedback.leftEncoderDelta);
  writeI32LE(&payloadOut[8], feedback.rightEncoderDelta);
  payloadOut[12] = static_cast<uint8_t>(feedback.leftPwmAppliedPercent);
  payloadOut[13] = static_cast<uint8_t>(feedback.rightPwmAppliedPercent);
  writeU16LE(&payloadOut[14], encodeCurrentTenths(feedback.leftMotorCurrentAmps));
  writeU16LE(&payloadOut[16], encodeCurrentTenths(feedback.rightMotorCurrentAmps));
  payloadOut[18] = feedback.watchdogHealthy ? 1 : 0;
  writeU16LE(&payloadOut[19], feedback.faultFlags);
}

// ===== Low-level motor output =====
void applyMotorHardware(MotorState &motor) {
  int8_t dirSign = motor.currentDirectionSign >= 0 ? 1 : -1;
  int directionBit = dirSign >= 0 ? 0 : 1;
  digitalWrite(motor.dirPin, directionBit ^ (motor.inverted ? 1 : 0));

  // Mirror the sign that just drove the DIR pin into the volatile cache the
  // encoder ISR reads. Doing it here (the only place that writes the DIR
  // pin) keeps the cache and the pin in lockstep — the ISR can rely on the
  // cache being a faithful record of the last commanded direction.
  if (motor.dirPin == LEFT_DIR_PIN) {
    g_leftDirSign = dirSign;
  } else if (motor.dirPin == RIGHT_DIR_PIN) {
    g_rightDirSign = dirSign;
  }

  int duty = (abs(motor.appliedPwmPercent) * PWM_MAX_DUTY) / 100;
  ledc_set_duty(PWM_MODE, motor.pwmChannel, duty);
  ledc_update_duty(PWM_MODE, motor.pwmChannel);
}

void forceMotorStop(MotorState &motor) {
  motor.requestedPwmPercent = 0;
  motor.appliedPwmPercent = 0;
  // Leave currentDirectionSign at its last non-zero value. The DIR pin is
  // driven from this field, and the encoder ISR signs coast pulses by the
  // pin level. Zeroing the sign here would flip the DIR pin to a default
  // ("forward") while the wheel is still coasting in the prior direction,
  // mis-signing every coast pulse during the brake-to-stop window.
  motor.targetPercent = 0.0f;
  motor.rampedTargetPercent = 0.0f;
  applyMotorHardware(motor);
}

void stepMotorTowardRequested(MotorState &motor, uint32_t elapsedMs, float accelRatePercentPerSecond, float decelRatePercentPerSecond) {
  // The Pi owns control. This ESP32 only ramps the requested duty toward the
  // latest accepted target and handles safe direction reversals through zero.
  motor.rampedTargetPercent = motor.targetPercent;

  if (fabs(motor.rampedTargetPercent) < DEFAULT_MIN_EFFECTIVE_WHEEL_OUTPUT_PERCENT) {
    motor.requestedPwmPercent = 0;
  } else {
    motor.requestedPwmPercent = clampPercent(
      static_cast<int>(motor.rampedTargetPercent * 100.0f)
    );
  }

