davidgoddard/mower2026/external-hardware/esp32/motor-controller/motor-controller.ino
  if (!allowDrive) {
    forceMotorStop(g_leftMotor);
    forceMotorStop(g_rightMotor);
    lastStepMillis = nowMillis;
    return;
  }

  uint32_t elapsedMs = nowMillis - lastStepMillis;
  if (elapsedMs == 0 || elapsedMs > (CONTROL_PERIOD_MS * 2)) {
    elapsedMs = CONTROL_PERIOD_MS;
  }
  lastStepMillis = nowMillis;

  // Wire field is 1/rampSeconds; convert to %/s: rate = wireValue × 100.
  float accelRate = commandSnapshot.hasAccelLimit
    ? commandSnapshot.maxAccelerationPercentPerSecond * 100.0f
    : DEFAULT_ACCEL_PERCENT_PER_SECOND;
  float decelRate = commandSnapshot.hasDecelLimit
    ? commandSnapshot.maxDecelerationPercentPerSecond * 100.0f
    : DEFAULT_DECEL_PERCENT_PER_SECOND;

  stepMotorTowardRequested(g_leftMotor, elapsedMs, accelRate, decelRate);
  stepMotorTowardRequested(g_rightMotor, elapsedMs, accelRate, decelRate);
}

// ===== I2C =====
void onReceive(int numBytes) {
  if (numBytes <= 0 || numBytes > static_cast<int>(MAX_FRAME_SIZE)) {
    while (Wire.available()) {
      Wire.read();
    }
    return;
  }

  uint8_t buffer[MAX_FRAME_SIZE];
  int count = 0;
  while (Wire.available() && count < numBytes) {
    buffer[count++] = Wire.read();
  }

  uint8_t messageType = 0;
  uint16_t sequence = 0;
  uint16_t payloadLength = 0;
  const uint8_t *payload = nullptr;
  if (!decodeFrame(buffer, count, messageType, sequence, payload, payloadLength)) {
    return;
  }

  if (messageType == MESSAGE_TYPE_WHEEL_SPEED_COMMAND) {
    WheelSpeedCommand decoded;
    if (decodeWheelSpeedCommandPayload(payload, payloadLength, decoded)) {
      portENTER_CRITICAL(&g_protocolStateMux);
      g_latestCommand = decoded;
      g_lastValidCommandMillis = millis();
      g_haveValidCommand = true;
      portEXIT_CRITICAL(&g_protocolStateMux);
    }
  }
}

void onRequest() {
  const uint8_t activeIndex = g_activeTxFrameIndex;
  Wire.write(g_txFrames[activeIndex], MOTOR_FEEDBACK_FRAME_SIZE);
}

void configureTaskWatchdog() {
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t config = {
    .timeout_ms = TASK_WATCHDOG_TIMEOUT_SECONDS * 1000,
    .idle_core_mask = 0,
    .trigger_panic = true,
  };
  esp_task_wdt_init(&config);
#else
  esp_task_wdt_init(TASK_WATCHDOG_TIMEOUT_SECONDS, true);
#endif
  esp_task_wdt_add(nullptr);
}

// ===== Setup / loop =====
void configurePwm() {
  ledc_timer_config_t timerConfig;
  memset(&timerConfig, 0, sizeof(timerConfig));
  timerConfig.speed_mode = PWM_MODE;
  timerConfig.timer_num = PWM_TIMER;
  timerConfig.freq_hz = PWM_FREQ_HZ;
  timerConfig.duty_resolution = PWM_RESOLUTION;
  timerConfig.clk_cfg = LEDC_AUTO_CLK;
  ledc_timer_config(&timerConfig);

  ledc_channel_config_t leftChannelConfig;
  memset(&leftChannelConfig, 0, sizeof(leftChannelConfig));
  leftChannelConfig.gpio_num = LEFT_PWM_PIN;
  leftChannelConfig.speed_mode = PWM_MODE;
  leftChannelConfig.channel = LEFT_CHANNEL;
  leftChannelConfig.intr_type = LEDC_INTR_DISABLE;
  leftChannelConfig.timer_sel = PWM_TIMER;
  leftChannelConfig.duty = 0;
  ledc_channel_config(&leftChannelConfig);

  ledc_channel_config_t rightChannelConfig = leftChannelConfig;
  rightChannelConfig.gpio_num = RIGHT_PWM_PIN;
  rightChannelConfig.channel = RIGHT_CHANNEL;
  ledc_channel_config(&rightChannelConfig);
}

void setup() {
  Serial.begin(115200);

  pinMode(LEFT_DIR_PIN, OUTPUT);
  pinMode(RIGHT_DIR_PIN, OUTPUT);
  pinMode(LEFT_TACH_PIN, INPUT_PULLUP);
  pinMode(RIGHT_TACH_PIN, INPUT_PULLUP);
  pinMode(LEFT_CURRENT_SENSE_PIN, INPUT);
  pinMode(RIGHT_CURRENT_SENSE_PIN, INPUT);

  analogReadResolution(12);
  analogSetPinAttenuation(LEFT_CURRENT_SENSE_PIN, ADC_11db);
  analogSetPinAttenuation(RIGHT_CURRENT_SENSE_PIN, ADC_11db);

  configurePwm();
  applyMotorHardware(g_leftMotor);
  applyMotorHardware(g_rightMotor);
  calibrateCurrentSensor(g_leftCurrentSensor);
  calibrateCurrentSensor(g_rightCurrentSensor);

  attachInterrupt(digitalPinToInterrupt(LEFT_TACH_PIN), onLeftPulse, FALLING);
  attachInterrupt(digitalPinToInterrupt(RIGHT_TACH_PIN), onRightPulse, FALLING);

  Wire.begin(I2C_SLAVE_ADDRESS, SDA_PIN, SCL_PIN, 400000);
  Wire.onReceive(onReceive);
  Wire.onRequest(onRequest);

  refreshFeedbackSnapshot(millis());
  refreshFeedbackSnapshot(millis());
  configureTaskWatchdog();
}

void loop() {
  esp_task_wdt_reset();
  uint32_t nowMillis = millis();
  if ((nowMillis - g_lastControlMillis) >= CONTROL_PERIOD_MS) {
    g_lastControlMillis = nowMillis;
    runControlStep(nowMillis);
  }

  if ((nowMillis - g_lastFeedbackMillis) >= FEEDBACK_PERIOD_MS) {
    g_lastFeedbackMillis = nowMillis;
    refreshFeedbackSnapshot(nowMillis);
  }
}
